Revit 2026 API

# WireMaterialTypeAddGroundConductorSize Method

---

Add new electrical ground conductor size type into this material type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public GroundConductorSize AddGroundConductorSize(
	long ampacity,
	string size
)
```
```vb
Public Function AddGroundConductorSize (
	ampacity As Long,
	size As String
) As GroundConductorSize
```
```cpp
public:
GroundConductorSize^ AddGroundConductorSize(
	long long ampacity,
	String^ size
)
```
```fsharp
member AddGroundConductorSize :
        ampacity : int64 *
        size : string -> GroundConductorSize
```

#### Parameters

ampacity Int64
    Ampacity of ground conductor size to be added.
size String
    Size of ground conductor size to be added.

#### Return Value

GroundConductorSizeNew added ground conductor size.

#### Reference

WireMaterialType Class

Autodesk.Revit.DB.Electrical Namespace